package work_01_11_25;
/*уровень 1: Базовые задания
Задание 1: Вывод чисел
        Напишите программу, которая выводит числа от 1 до 10.

Подсказка: Используйте цикл for.
*/
public class task_1 {
    public static void main(String[] args) {
        for (int n = 1; n <= 10; n++){
            System.out.println(n);
        }
    }
}
