package work_01_11_25;

public class task_3 {
    /*Задание 3: Обратный отсчёт
Напишите программу, которая выводит числа от 10 до 1 в обратном порядке.
     */
    public static void main(String[] args) {
        for (int i = 10; i>=1; i--){
            System.out.println(i);
        }
    }
}
